In [33]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
df['col2'].nunique()

3

In [11]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [13]:
df[df['col2'] > 1]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df[(df['col2'] > 1) & (df['col2'] == 444)'

In [ ]:
#apply method

In [15]:
def times2(x):
    return x*2

In [19]:
df['col1'].apply(times2) #you can apply a function to the entirety of a column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df.loc[3,'col1'] = 5

In [35]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df.rename(columns = {'col3':'col4'}, inplace = True)

In [39]:
df

   col1  col2 col4
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [41]:
df.rename(columns={'col4':'col3'}, inplace = True)

In [43]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [51]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [53]:
fun = lambda x : x**2

In [55]:
df['col1'].apply(fun)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [62]:
df.drop('col3', axis = 1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [64]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [66]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [68]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
df.sort_values(by = 'col2', ascending = False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [72]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [74]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [86]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [90]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df2 = pd.DataFrame(data)

In [92]:
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [94]:
df2.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN